Repository: milan-b/workTracker
Catalog: Client/src/locale/messages.*.xlf
Languages: de

source: Name is <strong>required</strong>
de: Name ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Select product category
de: Produktkategorie auswählen

source: {{ productCategoryForm.controls['parentId'].value ? productCategories!.get(productCategoryForm.controls['parentId'].value!)?.name : "Parent" }}
de: {INTERPOLATION}

source: Product category is <strong>required</strong>
de: Produktkategorie ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Create
de: Erstellen

source: Edit
de: Bearbeiten

source: Error while getting project.
de: Fehler beim Abrufen des Projekts.

source: Product category this.productCategoryForm.value.name is saved.
de: Produktkategorie wird gespeichert.

source: You can't delete this category because it has children. Children of this node are: children
de: Sie können diese Kategorie nicht löschen, da sie untergeordnete Elemente hat. Kinder dieses Knotens sind:

source: You can't delete this category because there are some products that belongs to it. Those products are: productNames
de: Sie können diese Kategorie nicht löschen, da einige Produkte dazu gehören. Diese Produkte sind:

source: Category deleted
de: Kategorie gelöscht

source: Select product category
de: Produktkategorie auswählen

source: Selected: <strong *ngIf="selectedItem">{{selectedItem.name}}</strong>
de: Ausgewählt: <strong>{INTERPOLATION}{CLOSE_TAG_STRONG}

source: Parent
de: Elternteil

source: Select
de: Wählen

source: Units
de: Einheiten

source: Units are <strong>required</strong>
de: Einheiten sind <strong>erforderlich{CLOSE_TAG_STRONG}

source: Save
de: Speichern

source: Error while getting product.
de: Fehler beim Erhalten des Produkts.

source: Product this.productForm.value.name is saved.
de: Produkt ist gespeichert.

source: Product category
de: Produktkategorie

source: Description
de: Beschreibung

source: City
de: Ort

source: City is <strong>required</strong>
de: Ort ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Customer
de: Kunde

source: Customer is <strong>required</strong>
de: Kunde ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Project this.projectForm.value.name is saved.
de: Projekt wird gespeichert.

source: Customere
de: Kunde

source: Created
de: Erstellt

source: {{data.title}}
de: {INTERPOLATION}

source: Product
de: Produkt

source: Amount
de: Menge

source: Unit
de: Einheit

source: Are you sure that you want to close this document?
de: Sind Sie sicher, dass Sie dieses Dokument schließen möchten?

source: Document is downloaded.
de: Dokument wird heruntergeladen.

source: Filter products by category
de: Filtern Sie Produkte nach Kategorie

source: Product is <strong>required</strong>
de: Produkt ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Amount is <strong>required</strong>
de: Betrag ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Unit is <strong>required</strong>
de: Einheit ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Note
de: Bemerkung

source: Child product:
de: Untergeordnetes Produkt:

source: Cancle
de: Abbrechen

source: Error while getting work log entry.
de: Fehler beim Abrufen des Arbeitsprotokolleintrags.

source: Work log entry is saved.
de: Der Arbeitsprotokolleintrag wird gespeichert.

source: Form data is not saved. Are you sure that you want to leave it?
de: Formulardaten werden nicht gespeichert. Sind Sie sicher, dass Sie es verlassen möchten?

source: <mat-icon fontIcon="{{workLog?.isApproved ? 'check_box' : 'check_box_outline_blank'}}"></mat-icon> Approve
de: Genehmigen

source: You can't add entries to approved work log.
de: Sie können dem genehmigten Arbeitsprotokoll keine Einträge hinzufügen.

source: You can't change entries in approved work log.
de: Sie können Einträge im genehmigten Arbeitsprotokoll nicht ändern.

source: Are you sure that you want to delete this work log entry?
de: Sind Sie sicher, dass Sie diesen Arbeitsprotokolleintrag löschen möchten?

source: Work log entry is deleted.
de: Arbeitsprotokolleintrag wird gelöscht.

source: Date:
de: Datum:

source: Date is <strong>required</strong>
de: Datum ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Project
de: Projekt

source: Project is <strong>required</strong>
de: Projekt ist <strong>erforderlich{CLOSE_TAG_STRONG}

source: Error while getting work log.
de: Fehler beim Abrufen des Arbeitsprotokolls.

source: Worklog is saved.
de: Arbeitsprotokoll wird gespeichert.

source: Filter by project
de: Nach Projekt filtern

source: Filter by approved
de: Filtern nach genehmigt

source: Is Approved
de: Ist genehmigt

source: Yes
de: Ja

source: No
de: NEIN

source: Date
de: Datum

source: User
de: Benutzer
